var app_sqarr = [
	" 河北的阚** 134****2102 ",
	" 吉林的国** 150****3434 ",
	" 吉林的闾** 158****3389 ",
	" 湖北的钦** 132****3433 ",
	" 陕西的丘** 155****4241 ",
	" 贵州的木** 151****3669 ",
	" 新疆的良** 131****8299 ",
	" 甘肃的公** 131****5933 ",
	" 吉林的鞠** 150****7054 ",
	" 广东的羊** 139****6586 ",
	" 西藏的贲** 134****2156 ",
	" 四川的谷** 130****2504 ",
	" 四川的充** 152****5350 ",
	" 安徽的福** 139****0389 ",
	" 山东的胥** 133****3755 ",
	" 新疆的葛** 156****8666 ",
	" 浙江的蒋** 159****3902 ",
	" 贵州的娄** 138****2899 ",
	" 云南的纪** 130****3717 ",
	" 山西的左** 159****8231 ",
	" 广东的贺** 156****0052 ",
	" 安徽的荀** 137****0713 ",
	" 重庆的裘** 133****8183 ",
	" 陕西的单** 152****7243 ",
	" 安徽的强** 150****7910 ",
	" 宁夏的杜** 137****2636 ",
	" 辽宁的加** 157****6062 ",
	" 北京的滑** 137****3437 ",
	" 甘肃的正** 136****3602 ",
	" 西藏的惠** 138****2474 ",
	" 河北的臧** 139****6388 ",
	" 辽宁的隆** 137****7084 ",
	" 河北的慕** 136****0227 ",
	" 陕西的乐** 156****2898 ",
	" 天津的缪** 132****3377 ",
	" 重庆的尉** 151****2368 ",
	" 海南的阎** 133****2316 ",
	" 福建的都** 130****4842 ",
	" 福建的喻** 156****1270 ",
	" 陕西的霍** 132****2679 ",
	" 新疆的祖** 155****8102 ",
	" 重庆的衡** 138****7923 ",
	" 新疆的阙** 133****4074 ",
	" 重庆的政** 157****0097 ",
	" 重庆的姬** 158****3907 ",
	" 福建的商** 131****5023 ",
	" 内蒙古的温** 158****2456 ",
	" 安徽的卢** 139****3868 ",
	" 内蒙古的能** 136****2394 ",
	" 湖南的贾** 151****6986 ",
];

var ktfw_list = ["蓝V认证", "抖音团购", "蓝V认证 + 抖音团购"];

var app_sqarr_list = [];
for (let i = 0; i < app_sqarr.length; i++) {
	app_sqarr_list.push(new Date().toLocaleDateString() + app_sqarr[i] + "成功开通了");
}

var swiper1_list = [];
for (let i = 0; i < 10; i++) {
	swiper1_list.push({
		name: app_sqarr[parseInt(Math.random() * app_sqarr.length, 10)],
		text: ktfw_list[parseInt(Math.random() * ktfw_list.length, 10)],
		img:
			"https://wzck-1252188577.cos.ap-beijing.myqcloud.com/head/" +
			parseInt(Math.random() * (57 + 1), 10) +
			".jpg",
	});
}
